#pragma once

#include<iostream>
#include <sstream>
#include <exception>

using namespace std;

namespace cp {
	//--------------------------------------------------------------------------------------
	///	文字列型
	//--------------------------------------------------------------------------------------
	class String {
		char* m_pdata{ nullptr };
		size_t m_capacity{16};
		size_t m_size{};
		size_t m_maxsize{sizeof(size_t)};
	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		String() {}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	コンストラクタ
		@param[in]	data	初期化する文字列
		*/
		//--------------------------------------------------------------------------------------
		String(const char* data) {
			size_t i = 0;
			while (data[i] != '\0') {
				if (i >= (m_maxsize - 1)) {
					throw runtime_error("error: memory cannot be secured.");
				}
				i++;
			}
			m_size = i;
			while (m_capacity < m_size) {
				m_capacity *= 2;
			}
			m_pdata = new char[m_capacity];
			strcpy_s(m_pdata, m_capacity - 1, data);
		}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		~String(){
			delete[] m_pdata;
		}
		//--------------------------------------------------------------------------------------
		/*!
		@brief	文字列の先頭のポインタの取得
		@return	文字列の先頭のポインタ
		*/
		//--------------------------------------------------------------------------------------
		const char* data() const {
			return m_pdata;
		}
	};
	//--------------------------------------------------------------------------------------
	/*!
	@brief	Stringをcoutで使えるようにする
	@param[in]	os	ostreamの参照
	@param[in]	s	Stringの参照
	@return	ostreamの参照
	*/
	//--------------------------------------------------------------------------------------
	inline ostream& operator <<(ostream& os, const String& s)
	{
		os << s.data();
		return os;
	};

}
//end namespace cp
